tap "buo/cask-upgrade"
tap "epk/epk"
tap "homebrew/cask"
tap "homebrew/command-not-found"
tap "homebrew/test-bot"
tap "jorgelbg/tap"
tap "rcmdnk/file"
brew "python@3.12"
brew "aider"
brew "python@3.13"
brew "ansible"
brew "certbot"
brew "chezmoi"
brew "csvkit"
brew "diffutils"
brew "dive"
brew "dust"
brew "node"
brew "eslint"
brew "fd"
brew "icu4c@76"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "glab"
brew "glow"
brew "gnupg"
brew "go"
brew "gtop"
brew "inetutils"
brew "jq"
brew "lsd"
brew "nmap"
brew "pkgconf"
brew "nodenv"
brew "noti"
brew "oh-my-posh"
brew "okteto"
brew "ollama"
brew "onefetch"
brew "openjdk"
brew "pandoc"
brew "poetry"
brew "poppler"
brew "pre-commit"
brew "prettier"
brew "pytest"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "ripgrep"
brew "ripgrep-all"
brew "rust"
brew "shellcheck"
brew "shellspec"
brew "shfmt"
brew "six"
brew "speedtest-cli"
brew "tree"
brew "virtualenv"
brew "xdg-ninja"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "rcmdnk/file/brew-file"
cask "1password"
cask "1password-cli"
cask "adguard-vpn"
cask "amazon-photos"
cask "balenaetcher"
cask "battle-net"
cask "chatgpt" if Hardware::CPU.arm?
cask "claude"
cask "discord"
cask "docker"
cask "emojipedia"
cask "epic-games"
cask "firefox"
cask "font-blex-mono-nerd-font"
cask "font-sf-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "messenger"
cask "microsoft-edge"
unless system("brew list --cask | grep -q opensc")
  system("curl -fsSL 'https://raw.githubusercontent.com/Homebrew/homebrew-cask/326c44e93aeb8d4dd73acea14a99ae215c75fdd6/Casks/o/opensc.rb' -o /tmp/opensc.rb")
  system("brew install --cask /tmp/opensc.rb")
  system("rm -f /tmp/opensc.rb")
end
cask "pycharm"
cask "slack"
cask "sony-ps-remote-play"
cask "steam"
cask "the-unarchiver"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "webtorrent"
cask "whatsapp"
cask "windows-app"
cask "zed"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Perplexity", id: 6714467650
mas "Prime Video", id: 545519333
mas "Remote Desktop", id: 409907375
mas "Speedtest", id: 1153157709
mas "Stockfish", id: 801463932
mas "Xcode", id: 497799835
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "openai.chatgpt"
